# Upload to database: weather data

This notebook will outline the process of loading the csv files with the cleansed data and uploading it to the database using PostgreSQL and SQLAlchemy within Python

In [ ]:
# Imports

import pandas as pd 
from dotenv import load_dotenv, dotenv_values
import os

from sqlalchemy import create_engine, types
from sqlalchemy import text # to be able to pass string
from sqlalchemy import Integer, String, Float, DateTime, Date

In [118]:
# Loading values from .env
config = dotenv_values()

# Define variables for the login
load_dotenv()
user = os.getenv("DB_USER")
password = os.getenv("DB_PASSWORD")
host = os.getenv("DB_HOST")
port = os.getenv("DB_PORT")
dbname = os.getenv("DB_NAME")
schema = os.getenv("DB_SCHEMA")

# PostgreSQL URL creation
url = f'postgresql://{user}:{password}@{host}:{port}/{dbname}'

In [119]:
# Load the dataframes from the csv files

df_uk_weather = pd.read_csv('./datasets/jl_uk_weather.csv')
df_nz_rain = pd.read_csv('./datasets/jl_nz_rainfall.csv')
df_nz_temp = pd.read_csv('./datasets/jl_nz_temperatures.csv')

In [120]:
# Create the engine to load data
engine = create_engine(url, echo=False)

# Setting schema
with engine.begin() as conn: 
    result = conn.execute(text(f'SET search_path TO {schema};'))

We are going now to upload the three dataframes, with data coming from csv loaded files. This will be done to a database with the engine above created and specifying the columns in each of the dataframes, via PostgreSQL and SQLAlchemy.

In [121]:
# df_uk_weather

# We will check here the columns and types

df_uk_weather

            Date  avg_temp_uk  avg_rain_uk
0     2022-01-01        11.80         1.72
1     2022-01-02         9.25         5.54
2     2022-01-03         7.22         5.26
3     2022-01-04         3.00         1.10
4     2022-01-05         1.98         0.00
...          ...          ...          ...
1456  2025-12-27         3.77         0.00
1457  2025-12-28         4.68         0.00
1458  2025-12-29         3.60         0.00
1459  2025-12-30         2.72         0.00
1460  2025-12-31         1.39         0.04

[1461 rows x 3 columns]

In [122]:
# Upload the dataframe to the database

df_uk_weather.to_sql(
    "jl_uk_weather",
    engine,
    schema = schema,
    if_exists="replace", # this replaces an existing table!
    index=False,
    dtype={
        "Date": Date(),
        "avg_temp_uk": Float(),
        "avg_rain_uk": Float(),
    }
)

461

In [123]:
# df_nz_rain

# We will check here the columns and types

df_nz_rain

            Date  1615  24120  41212  41382  5451  Daily mean mm
0     2022-01-01   0.0    0.0    0.0    0.0   0.0           0.00
1     2022-01-02   0.0    0.0    0.0    0.0   0.0           0.00
2     2022-01-03   0.0    0.0    0.0    0.0   0.0           0.00
3     2022-01-04   0.0    0.0    0.0    0.0   0.0           0.00
4     2022-01-05   0.0    0.0    0.0    0.0   0.0           0.00
...          ...   ...    ...    ...    ...   ...            ...
1456  2025-12-27   0.2    3.8    0.0    0.0   2.8           1.00
1457  2025-12-28   0.8    0.0    0.0    0.0   0.0           0.20
1458  2025-12-29  26.6    0.0    0.6    0.0   0.0           6.80
1459  2025-12-30   0.1    3.0   18.0    8.6   0.0           7.43
1460  2025-12-31   2.1    3.6    1.2   43.4   0.0          12.58

[1461 rows x 7 columns]

In [124]:
# Upload the dataframe to the database

df_nz_rain.to_sql(
    "jl_nz_rain",
    engine,
    schema = schema,
    if_exists="replace", # this replaces an existing table!
    index=False,
    dtype={
        "Date": Date(),
        "1615": Float(),
        "24120": Float(),
        "41212": Float(),
        "41382": Float(),
        "5451": Float(),
        "Daily mean mm": Float()
    }
)

461

In [125]:
# df_nz_temp

# We will check here the columns and types

df_nz_temp

            Date  1615  24120  41212  41382  5451  Daily mean C
0     2022-01-01  22.7   21.6   20.4   17.8  17.9         20.62
1     2022-01-02  19.9   19.5   24.2   19.1  21.3         20.67
2     2022-01-03  20.9   20.6   21.5   19.3  20.0         20.58
3     2022-01-04  22.3   20.9   21.3   18.6  17.8         20.78
4     2022-01-05  22.9   19.5   17.9   19.1  17.6         19.85
...          ...   ...    ...    ...    ...   ...           ...
1456  2025-12-27  16.6   15.4   19.3   13.7  10.4         16.25
1457  2025-12-28  19.2   15.2   19.1   16.4  12.8         17.48
1458  2025-12-29  18.1   17.0   18.2   22.2  14.9         18.88
1459  2025-12-30  21.9   13.5   15.7   16.7  14.0         16.95
1460  2025-12-31  21.9   17.3   18.3   19.9  17.2         19.35

[1461 rows x 7 columns]

In [126]:
# Upload the dataframe to the database

df_nz_temp.to_sql(
    "jl_nz_temp",
    engine,
    schema = schema,
    if_exists="replace", # this replaces an existing table!
    index=False,
    dtype={
        "Date": Date(),
        "1615": Float(),
        "24120": Float(),
        "41212": Float(),
        "41382": Float(),
        "5451": Float(),
        "Daily mean C": Float()
    }
)

461